Tasks/ЗадачаИсполнителя/ЗадачаИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаИсполнителя</name>
  <addressing>InformationRegister.РолиИИсполнители</addressing>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадачПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачи</name>
    <type>
      <types>DocumentRef.РегистрацияРазовыхУдержанийРаботниковОрганизаций</types>
      <types>DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</types>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.ОплатаСверхурочныхЧасов</types>
      <types>DocumentRef.НачислениеПоБольничномуЛисту</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.Сторнирование</types>
      <types>DocumentRef.НевыходыВОрганизациях</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.НачислениеОтпускаРаботникамОрганизаций</types>
      <types>DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</types>
      <types>DocumentRef.ПремииРаботниковОрганизаций</types>
      <types>DocumentRef.ТабельУчетаРабочегоВремениОрганизации</types>
      <types>DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</types>
      <types>DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</types>
      <types>DocumentRef.РегистрацияПростоевРаботниковОрганизаций</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.КомандировкиОрганизаций</types>
      <types>DocumentRef.Событие</types>
      <types>Number</types>
      <types>DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
      <types>DocumentRef.НеявкиИБолезниОрганизаций</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
      <types>DocumentRef.ОтпускаОрганизаций</types>
      <types>DocumentRef.ПереносДанных</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

Catalogs/ВидыЗадачПользователей/ВидыЗадачПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗадачПользователей</name>
  <predefined>
    <items>
      <name>ВозвратНаРаботу</name>
      <description>Возврат на работу</description>
    </items>
    <items>
      <name>ДеньРождения</name>
      <description>День рождения</description>
    </items>
    <items>
      <name>Доначисление</name>
      <description>Доначисление</description>
    </items>
    <items>
      <name>Исполнение</name>
      <description>Исполнение</description>
    </items>
    <items>
      <name>КадровоеПеремещение</name>
      <description>Кадровое перемещение</description>
    </items>
    <items>
      <name>НачислениеПоКадровомуДокументу</name>
      <description>Начисление по кадровому документу</description>
    </items>
    <items>
      <name>ОтражениеЗарплатыВУчете</name>
      <description>Отражение зарплаты в учете</description>
    </items>
    <items>
      <name>ОценкаИспытательногоСрока</name>
      <description>Оценка испытательного срока</description>
    </items>
    <items>
      <name>ОшибкиПриемаПоОсновномуМестуРаботы</name>
      <description>Ошибки приема по основному месту работы</description>
    </items>
    <items>
      <name>ОшибкиПриемаПоСовместительству</name>
      <description>Ошибки приема по совместительству</description>
    </items>
    <items>
      <name>Перезаполнение</name>
      <description>Перезаполнение</description>
    </items>
    <items>
      <name>Перерасчет</name>
      <description>Перерасчет</description>
    </items>
    <items>
      <name>ПриемНаРаботу</name>
      <description>Прием на работу</description>
    </items>
    <items>
      <name>ПроизводственныйКалендарь</name>
      <description>Производственный календарь</description>
    </items>
    <items>
      <name>РасчетЕСН</name>
      <description>Расчет ЕСН (до 2010 года)</description>
    </items>
    <items>
      <name>РасчетЗарплаты</name>
      <description>Расчет зарплаты</description>
    </items>
    <items>
      <name>РасчетСтраховыхВзносов</name>
      <description>Расчет страховых взносов (с 2010 года)</description>
    </items>
    <items>
      <name>СведенияОСтавкахЕСНиПФР</name>
      <description>Сведения о ставках ЕСН и ПФР (до 2010 года)</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>Увольнение</name>
      <description>Увольнение</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Tasks/ЗадачаИсполнителя/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// По описателям состояния задачи (реквизитам адресации) формирует текст инфо-строки и важность сообщения
//
// Параметры
//	Исполнитель, Роль, Организация, Выполнена - реквизиты, влияющие на состояние задачи
//
// Возвращаемое значение:
//	Структура из двух строковых значений - ТекстСообщения и ВажностьСообщения
//
Функция ПолучитьОписаниеОбъекта(Исполнитель, Роль, Организация, Выполнена) Экспорт
	
	Если Выполнена Тогда
		ТекстСообщения		= "Задача выполнена";
	Иначе
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ТекстСообщения		= "Задачу может выполнить только " + Исполнитель;
		Иначе
			ОписаниеРоли = "";
			Если ЗначениеЗаполнено(Роль) Тогда
				ОписаниеРоли = НРег(Строка(Роль));
			Иначе
				ОписаниеРоли = "кадровик или расчетчик";
			КонецЕсли;
			
			ОписаниеОрганизации = "";
			Если ЗначениеЗаполнено(Организация) Тогда
				ОписаниеОрганизации = " " + ОбщегоНазначенияЗК.ПреобразоватьСтрокуИнтерфейса("организации") + " " + Строка(Организация);
			КонецЕсли;
			
			ТекстСообщения		= "Задачу может выполнить любой " + ОписаниеРоли + ОписаниеОрганизации;
			
			РеквизитыАдресации = Новый Структура;
			Для Каждого Реквизит Из Метаданные().РеквизитыАдресации Цикл
				РеквизитыАдресации.Вставить(Реквизит.Имя, ЭтотОбъект[Реквизит.Имя]);
			КонецЦикла;
			УправлениеЗадачамиПереопределяемый.ДополнитьТекстОписанияЗадачи(ТекстСообщения, РеквизитыАдресации); 
			
		КонецЕсли;
	КонецЕсли;
	
	ВажностьСообщения	= "";
	
	Возврат Новый Структура("ТекстСообщения,ВажностьСообщения", ТекстСообщения, ВажностьСообщения)
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередВыполнением()
	
	// Исполнитель берется из параметра сеанса
	Если Исполнитель.Пустая() Тогда
		Исполнитель = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	
	УправлениеЗадачами.ОтменитьЗадачу(ВидЗадачи, ОбъектЗадачи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если  Выполнена = Истина Тогда
		Запрос = Новый Запрос();
		Запрос.Параметры.Вставить("ОбъектЗадачи", ОбъектЗадачи);
		Запрос.Параметры.Вставить("Уровень", Уровень);
		//{Лео Катанович
		//Только однотипные задачи 
		Запрос.Параметры.Вставить("ВидЗадачи", ВидЗадачи);
		
		//{Лео Катанович}

		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.Выполнена = Ложь И ЗадачаИсполнителя.ОбъектЗадачи = &ОбъектЗадачи
		|	И ЗадачаИсполнителя.Уровень = &Уровень И ЗадачаИсполнителя.ВидЗадачи = &ВидЗадачи";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ЗадачаОбъект.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			Если ЗадачаОбъект.Уровень = 0 Тогда
				 Если ЗадачаОбъект.ВидЗадачи <> Справочники.ВидыЗадачПользователей.Согласование И ЗадачаОбъект.ВидЗадачи <> Справочники.ВидыЗадачПользователей.Исполнение Тогда
				      Продолжить;
				 КонецЕсли;
			КонецЕсли;

			ЗадачаОбъект.Выполнена = Истина;
			ЗадачаОбъект.Записать();
		КонецЦикла;	
		
		
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
